jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/BootLoader_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
  /* STSAFE MW requires a data buffer to send/receive bytes over the bus.*/

  static uint8_t a_rx_tx_stsafea_data [STSAFEA_BUFFER_MAX_SIZE];
  uint8_t a_echo_data[3] = {0x01U, 0x02U, 0x03U};
  StSafeA_LVBuffer_t out_echo;

  /* Check Input parameters */
  if (pvInitArgs != NULL_PTR)
  {
    p_init_args = (CK_C_INITIALIZE_ARGS_PTR)(pvInitArgs);

    if (p_init_args->pReserved != NULL_PTR)
    {
      return CKR_ARGUMENTS_BAD;
    }
  }

  /* ========== Check PKCS11 status and session  ========== */

  /* Check if PKCS11 module has already been initialized */
  if (uInitialized == CK_TRUE)
  {
    return CKR_CRYPTOKI_ALREADY_INITIALIZED;
  }

  /* ========== Initialize CryptoKi ========== */
  uInitialized = CK_FALSE;

  if (STSAFE_OBJ_Init() == CKR_OK)
  {
    if (StSafeA_Init(&hStSafe, a_rx_tx_stsafea_data) == STSAFEA_OK)
    {
      /* Test STSAFE is configured properly: echo command */
      if (StSafeA_Echo(&hStSafe, a_echo_data, (uint16_t)(sizeof(a_echo_data)), &out_echo, STSAFEA_MAC_NONE)
          == STSAFEA_OK)
      {
        /* Init Session */
        if (SessionInit() == CKR_OK)
        {
          /* PKCS11 Initialized successfully */
          uInitialized = CK_TRUE;
        }
      }
    }
  }

  /*Check if initialization was successfull*/
  if (uInitialized == CK_FALSE)
  {
    return CKR_FUNCTION_FAILED;
  }

  return CKR_OK;
}


/**
  * @brief  C_Finalize indicates that an application is done with the Cryptoki library
  * @param  pReserved Reserved.  Should be NULL_PTR.
  * @retval CK_RV CKR_ARGUMENTS_BAD, CKR_OK.
  */
static CK_RV STSAFE_P11_Finalize(CK_VOID_PTR pvReserved)
{
  /* Check Input parameters */
  if (pvReserved != NULL_PTR)
  {
    return CKR_ARGUMENTS_BAD;
  }

  /* ========== Check PKCS11 status and session  ========== */

  /* Check if PKCS11 module has already been initialized */
  if (uInitialized == CK_FALSE)
  {
    return CKR_CRYPTOKI_NOT_INITIALIZED;
  }

  /*Reset STSAFE handle*/
  (void)memset(((StSafeA_Handle_t *)(&hStSafe)), 0, sizeof(hStSafe));

  /* Reset PKCS11 Initialization status */
  uInitialized = CK_FALSE;

  return CKR_OK;
}

/**
  * @brief  C_GetInfo returns general information about Cryptoki.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  pInfo     location that receives information
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED
  */
static CK_RV STSAFE_P11_GetInfo(CK_INFO_PTR pInfo)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}

/**
  * @brief  C_GetSlotList obtains a list of slots in the system.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  tokenPresent     only slots with tokens
  * @param  pSlotList     receives array of slot IDs
  * @param  pulCount      receives number of slots
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED
  */
static CK_RV STSAFE_P11_GetSlotList(CK_BBOOL tokenPresent, CK_SLOT_ID_PTR pSlotList, CK_ULONG_PTR pulCount)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}

/**
  * @brief  C_GetSlotInfo obtains information about a particular slot in the system
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  slotID     the ID of the slot
  * @param  pInfo     receives the slot information
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED
  */
static CK_RV STSAFE_P11_GetSlotInfo(CK_SLOT_ID slotID, CK_SLOT_INFO_PTR pInfo)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}

/**
  * @brief  C_GetTokenInfo obtains information about a particular token in the system
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  slotID     ID of the token's slot
  * @param  pInfo     receives the token information
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED
  */
static CK_RV STSAFE_P11_GetTokenInfo(CK_SLOT_ID slotID, CK_TOKEN_INFO_PTR pInfo)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}

/**
  * @brief  C_GetMechanismList obtains a list of mechanism types supported by a token
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  slotID     ID of token's slot
  * @param  pMechanismList     gets mech. array
  * @param  pulCount     gets # of mechs.
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED
  */
static CK_RV STSAFE_P11_GetMechanismList(CK_SLOT_ID slotID, CK_MECHANISM_TYPE_PTR pMechanismList, CK_ULONG_PTR pulCount)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}

/**
  * @brief  C_GetMechanismInfo obtains information about a particular mechanism possibly supported by a token.
  * @param  slotID     ID of the token's slot
  * @param  type     type of mechanism
  * @param  pInfo     receives mechanism info
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED
  */
static CK_RV STSAFE_P11_GetMechanismInfo(CK_SLOT_ID slotID, CK_MECHANISM_TYPE type, CK_MECHANISM_INFO_PTR pInfo)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}

/**
  * @brief  C_InitToken initializes a token.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  slotID     ID of the token's slot
  * @param  pPin     the SO's initial PIN
  * @param  ulPinLen     length in bytes of the PIN
  * @param  pLabel     32-byte token label (blank padded)
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED
  */
static CK_RV STSAFE_P11_InitToken(CK_SLOT_ID slotID, CK_UTF8CHAR_PTR pPin, CK_ULONG ulPinLen, CK_UTF8CHAR_PTR pLabel)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}

/**
  * @brief  C_InitPIN initializes the normal user's PIN.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession     the session's handle
  * @param  pPin     the normal user's PIN
  * @param  ulPinLen     length in bytes of the PIN
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED
  */
static CK_RV STSAFE_P11_InitPIN(CK_SESSION_HANDLE hSession, CK_UTF8CHAR_PTR pPin, CK_ULONG ulPinLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}

/**
  * @brief  C_SetPIN modifies the PIN of the user who is logged in.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession     the session's handle
  * @param  pOldPin     the old PIN
  * @param  ulOldLen     length of the old PIN
  * @param  pNewPin     the new PIN
  * @param  ulNewLen     length of the new PIN
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED
  */
static CK_RV STSAFE_P11_SetPIN(CK_SESSION_HANDLE hSession, CK_UTF8CHAR_PTR pOldPin, CK_ULONG ulOldLen,
                               CK_UTF8CHAR_PTR pNewPin, CK_ULONG ulNewLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}


/**
  * @brief  C_OpenSession opens a session between an application and a token.
  * @param  slotID     the slot's ID
  * @param  flags     from CK_SESSION_INFO
  * @param  pApplication     passed to callback
  * @param  Notify     callback function
  * @param  phSession     gets session handle
  * @retval CK_RV CKR_ARGUMENTS_BAD, CKR_CRYPTOKI_NOT_INITIALIZED, CKR_SLOT_ID_INVALID,
          CKR_SESSION_PARALLEL_NOT_SUPPORTED, CKR_SESSION_COUNT, CKR_OK.
  */
static CK_RV STSAFE_P11_OpenSession(CK_SLOT_ID slotID, CK_FLAGS flags,
                                    CK_VOID_PTR pApplication,  CK_NOTIFY Notify,
                                    CK_SESSION_HANDLE_PTR phSession)
{

  /* Check input parameters */
  if (phSession == NULL_PTR)
  {
    return CKR_ARGUMENTS_BAD;
  }

  /* ========== Check PKCS11 status and session  ========== */

  /* Check if PKCS11 module has already been initialized */
  if (uInitialized == CK_FALSE)
  {
    return CKR_CRYPTOKI_NOT_INITIALIZED;
  }

  /* Check the value of slotID: the only slot supported by this implementation is slotID = 0*/
  if (slotID != 0x0000U)
  {
    return CKR_SLOT_ID_INVALID;
  }

  /* As defined in PKCS11 spec: For legacy reasons, the CKF_SERIAL_SESSION bit MUST
  always be set; if a call to C_OpenSession does not have this bit set, the call
  should return unsuccessfully with the error code CKR_SESSION_PARALLEL_NOT_SUPPORTED.
  */
  if ((flags & CKF_SERIAL_SESSION) == 0x0000U)
  {
    return CKR_SESSION_PARALLEL_NOT_SUPPORTED;
  }

