jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/BootLoader_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
  /* Open Session */
  if (SessionOpen(slotID, flags, pApplication, Notify, phSession) != CKR_OK)
  {
    return CKR_SESSION_COUNT;
  }

  return CKR_OK;

}

/**
  * @brief  C_CloseSession closes a session between an application and a token.
  * @param  hSession     the session's handle
  * @retval CK_RV CKR_CRYPTOKI_NOT_INITIALIZED,CKR_SESSION_HANDLE_INVALID,
  *         CKR_GENERAL_ERROR, CKR_OK
  */
static CK_RV STSAFE_P11_CloseSession(CK_SESSION_HANDLE hSession)
{
  CK_OBJECT_HANDLE hObject, hObjectMin, hObjectMax;
  CK_ATTRIBUTE_PTR  p_template_embedded, p_attribute_embedded;
  CK_ULONG  ul_count_embedded;

  /* ========== Check PKCS11 status and session  ========== */

  /* Check if PKCS11 module has already been initialized */
  if (uInitialized == CK_FALSE)
  {
    return CKR_CRYPTOKI_NOT_INITIALIZED;
  }

  /* Check if Session handle specified in input is valid */
  if (SessionIsValid(hSession) != CKR_OK)
  {
    return CKR_SESSION_HANDLE_INVALID;
  }

  /* Check if Session is open */
  if (SessionIsOpen(hSession) != CKR_OK)
  {
    return CKR_OK;
  }

  /* ========== Reset session handle ========== */

  /*Get Objects handles for all objects allocated (both token objects and session objects)*/
  if (STSAFE_OBJ_GetObjectRange(&hObjectMin, &hObjectMax) != CKR_OK)
  {
    return CKR_GENERAL_ERROR;
  }

  /*Init the loop*/
  hObject = hObjectMin;

  /*Loop on all allocated objects */
  while (hObject < hObjectMax)
  {
    /* Get a pointer to the template of the embedded object corresponding to hObject handle  */
    if (STSAFE_OBJ_GetTemplateFromObjectHandle(&p_template_embedded, &ul_count_embedded, hObject) != CKR_OK)
    {
      return CKR_GENERAL_ERROR;
    }

    /* ========== Check CKA_VENDOR_SESSION_HANDLE attribute ========== */
    /* If the object is a session object and is assigned to this session,
     *  mark it as available (CKA_VENDOR_SESSION_HANDLE = CK_INVALID_HANDLE)*/
    if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_embedded, CKA_VENDOR_SESSION_HANDLE, p_template_embedded,
                                           ul_count_embedded) == CKR_OK)
    {
      /*Check if the object is assigned to this session*/
      if ((*((CK_VENDOR_SESSION_HANDLE *)(p_attribute_embedded->pValue))) == hSession)
      {
        /* Mark the object as available (i.e. CKA_VENDOR_SESSION_HANDLE = CK_INVALID_HANDLE)*/
        if (ObjectSetSession(hObject, CK_INVALID_HANDLE) != CKR_OK)
        {
          return CKR_GENERAL_ERROR;
        }
      }
    }

    /* Move to the next object */
    hObject++;
  }

  /* Close the session */
  if (SessionClose(hSession) != CKR_OK)
  {
    return CKR_GENERAL_ERROR;
  }

  /* Everythig is ok, return */
  return CKR_OK;
}

/**
  * @brief  C_CloseAllSessions closes all sessions with a token
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  slotID      the token's slot
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED
  */
static CK_RV STSAFE_P11_CloseAllSessions(CK_SLOT_ID slotID)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_GetSessionInfo obtains information about the session.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession     the session's handle
  * @param  pInfo     receives session info
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED
  */
static CK_RV STSAFE_P11_GetSessionInfo(CK_SESSION_HANDLE hSession, CK_SESSION_INFO_PTR pInfo)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_GetOperationState obtains the state of the cryptographic operation in a session
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession     the session's handle
  * @param  pOperationState     gets state
  * @param  pulOperationStateLen     gets state length
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED
  */
static CK_RV STSAFE_P11_GetOperationState(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pOperationState,
                                          CK_ULONG_PTR pulOperationStateLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_SetOperationState restores the state of the cryptographic operation in a session.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession     session's handle
  * @param  pOperationState     holds state
  * @param  ulOperationStateLen     holds state length
  * @param  hEncryptionKey     en/decryption key
  * @param  hAuthenticationKey     sign/verify key
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED
  */
static CK_RV STSAFE_P11_SetOperationState(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pOperationState,
                                          CK_ULONG ulOperationStateLen, CK_OBJECT_HANDLE hEncryptionKey,
                                          CK_OBJECT_HANDLE hAuthenticationKey)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_Login logs a user into a token.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession    the session's handle
  * @param  userType      the user type
  * @param  pPin      the user's PIN
  * @param  ulPinLen      the length of the PIN
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED
  */
static CK_RV STSAFE_P11_Login(CK_SESSION_HANDLE hSession, CK_USER_TYPE userType, CK_UTF8CHAR_PTR pPin,
                              CK_ULONG ulPinLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief   C_Logout logs a user out from a token.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession    the session's handle
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED
  */
static CK_RV STSAFE_P11_Logout(CK_SESSION_HANDLE hSession)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}

/**
  * @brief  C_CreateObject creates a new object.
  * @note   This implementation supports creation only of CKO_PUBLIC_KEY Objects for signature verification with
  *         C_Verify.
  *         Two types of objects can be created : NIST-P256 and NIST-P384
  *         (ref to P11_OBJ_ID_VER_256 and P11_OBJ_ID_VER_384).
  *         Each call to create object will overwrite the value of CKA_EC_POINT if all the templates parameters are
  *         consistent with the ones specified in the templates.
  *         Created objects are session objects and stored in non-volatile memory.
  *         The content of CKA_EC_POINT attribute is invalidated calling C_CloseSession()
  *         and not retained during power-off.
  * @param  hSession     the session's handle
  * @param  pTemplate     the object's template
  * @param  ulCount     attributes in template
  * @param  phObject     gets new object's handle.
  * @retval CK_RV CKR_ARGUMENTS_BAD, CKR_CRYPTOKI_NOT_INITIALIZED, CKR_SESSION_HANDLE_INVALID,
  *               CKR_SESSION_CLOSED,CKR_ATTRIBUTE_TYPE_INVALID, CKR_FUNCTION_FAILED, CKR_DEVICE_MEMORY, CKR_OK.
  */
static CK_RV STSAFE_P11_CreateObject(CK_SESSION_HANDLE hSession, CK_ATTRIBUTE_PTR pTemplate,
                                     CK_ULONG ulCount,  CK_OBJECT_HANDLE_PTR phObject)
{
  CK_RV e_ret_status;
  CK_OBJECT_HANDLE h_obj,h_obj_cert,h_cert_obj;
  CK_ATTRIBUTE_PTR  p_template_embedded,p_cert_template_embedded;
  CK_ULONG  ul_count_embedded,ul_cert_count_embedded;
  CK_ATTRIBUTE_PTR p_attribute_embedded,p_attribute_tmp;
  CK_ATTRIBUTE_PTR p_attribute_input;
  CK_ATTRIBUTE  p_template_filtered[STSAFE_P11_MAX_TEMPLATE_SIZE];
  CK_ULONG  ul_count_filtered;
  CK_ULONG ul_obj_cnt;
  CK_ATTRIBUTE  template_tmp,template_tmp_cert;
  CK_BBOOL object_found;
  CK_ATTRIBUTE_PTR p_attribute;
  CK_EXT_TOKEN_ZONE zone;


