jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/BootLoader_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
  /*Check input parameters*/
  if ((pTemplate == NULL_PTR) || (ulCount == 0UL) || (ulCount > STSAFE_P11_MAX_TEMPLATE_SIZE) || (phObject == NULL_PTR))
  {
    return CKR_ARGUMENTS_BAD;
  }

  /* ========== Check PKCS11 status and session  ========== */

  /* Check if PKCS11 module has already been initialized */
  if (uInitialized == CK_FALSE)
  {
    return CKR_CRYPTOKI_NOT_INITIALIZED;
  }

  /* Check if the Session handle specified in input is valid */
  if (SessionIsValid(hSession) != CKR_OK)
  {
    return CKR_SESSION_HANDLE_INVALID;
  }

  /* Check if Session is open */
  if (SessionIsOpen(hSession) != CKR_OK)
  {
    return CKR_SESSION_CLOSED;
  }
  /* Use case of Create object once object is a certificate, next release will implement update of the object as PKCS11 object */
  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute, CKO_CERTIFICATE , pTemplate, ulCount) == CKR_OK)
  {

    /* ==========  We should update certificate only if this is a dynamic object ========== */

    /* First we get CKA_LABEL this will allow later to identify required information about STSAFE Zones */

    if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute, CKA_LABEL, pTemplate, ulCount) == CKR_OK)
    {
      if (!memcmp(p_attribute->pValue, "DeviceCertificate", p_attribute->ulValueLen) == 0)      {

        (void) memcpy(&template_tmp.pValue, &p_attribute->pValue, p_attribute->ulValueLen);

        /* ==========  We manage a dynamic object, need to get certificate value and size  ========== */

        if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute, CKA_VALUE , pTemplate, ulCount) == CKR_OK)
        {
          /* ==========  We get informations from object template like zone number ========== */

          template_tmp.type = CKA_LABEL;

           /*Look for the object corresponding to Label, 1 single object*/
          if (FindObjectsFromTemplate(CKV_SESSION_HANDLE_ANY, &h_cert_obj, 1, &ul_obj_cnt, &template_tmp, 1) != CKR_OK)
          {
            return CKR_FUNCTION_FAILED;
          }

          /* Get a pointer to the object template*/

          if (STSAFE_OBJ_GetTemplateFromObjectHandle(&p_cert_template_embedded, &ul_cert_count_embedded, h_cert_obj) != CKR_OK)
          {
            return CKR_FUNCTION_FAILED;
          }

          /* Extract from the template the CKA_EXT_TOKEN_ZONE */

          if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_EXT_TOKEN_ZONE, p_cert_template_embedded,
                                                 ul_cert_count_embedded) != CKR_OK)
          {
            return CKR_FUNCTION_FAILED;
          }

          zone = (*((CK_EXT_TOKEN_ZONE *)(p_attribute_tmp->pValue)));

          STSAFEA_DYNAMIC_ALLOCATE_LV_BUFFER_VAR(StSafeA_LVBuffer_t, DatatoStore, (p_attribute->ulValueLen) + 2);

          DatatoStore.Length = p_attribute->ulValueLen;

          (void) memcpy(DatatoStore.Data,  p_attribute->pValue, p_attribute->ulValueLen);

          e_ret_status=StSafeUpdateZone(zone, DatatoStore,ZERO_OFFSET_ZONE);

          STSAFEA_DYNAMIC_FREE_LV_BUFFER_VAR(DatatoStore);

          if (e_ret_status != CKR_OK)
            return CKR_FUNCTION_FAILED;
          else
          {
            /* ========== Update attribute : Cert should be enabled for all sessions it's a dynamic object ========== */

            template_tmp_cert.type = CKA_LABEL;
            template_tmp_cert.pValue = P11_OBJ_LABEL_DYN_CRT;

            if (FindObjectsFromTemplate(CKV_SESSION_HANDLE_ANY, &h_obj_cert, 1, &ul_obj_cnt, &template_tmp_cert, 1) != CKR_OK)
            {
              return CKR_FUNCTION_FAILED;
            }

            /* ========== Update attribute : Cert should be enabled for all sessions  ========== */

            ObjectSetVendorObjectAvailability(h_obj_cert, CK_TRUE);

            *phObject = h_obj_cert;

            return CKR_OK;
          }
        }
      }
      else
        /* ========== Certificate is not a dynamic object because this is device certificate ========== */
        return CKR_OK;
    }
    else
    /* ========== We didn't found label for the certificate object  ========== */
      return CKR_FUNCTION_FAILED;
  }

  /* Use case of Create object once object is NOT a certificate */

  /* ======================== Prepare input template to look for pre-allocated object =================== */

  /* Since this implementation doesn't support dynamic memory allocation, the template specified in input will
    * have to match pre-allocated objects The only value that can be different is CKA_EC_POINT, the actual value
    * of the public key, that is unique per key.
    * Filter attributes so that they will not be considered when looking and comparing the template with pre-allocated
    * objects.
    */
  CK_ATTRIBUTE attribute_filter[] =  { {CKA_EC_POINT, NULL_PTR, 0}  } ;

  if (STSAFE_OBJ_FilterTemplate(p_template_filtered, &ul_count_filtered, pTemplate, ulCount, attribute_filter,
                                sizeof(attribute_filter) / sizeof(attribute_filter[0])) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

  /* ======================== Check if the object can be created =================== */
  /*  Note: In this implementation we only support creation of 256-bit or 384-bit keys used for C_Verify.
   *  Create Object can be used only to create either one of these two objects. The one selected will be
   *  overwritten.  */

  /*Init*/
  object_found = CK_FALSE;

  /*Point to the object pre-allocated for NISTP-256 bit verification key*/
  template_tmp.type = CKA_LABEL;
  template_tmp.pValue = P11_OBJ_LABEL_VER_PUB_KEY_256;

  /*Look for the object corresponding to 256-bit verification key message, 1 single object, no filter on session*/
  if (FindObjectsFromTemplate(CKV_SESSION_HANDLE_ANY, &h_obj, 1, &ul_obj_cnt, &template_tmp, 1) == CKR_OK)
  {
    /* Get a pointer to the template of the object  */
    if (STSAFE_OBJ_GetTemplateFromObjectHandle(&p_template_embedded, &ul_count_embedded, h_obj) == CKR_OK)
    {
      /*Compare embedded referefence object with input template filtered of 'unique' values (e.g. CKA_EC_POINT).*/
      if (STSAFE_OBJ_CompareTemplates(p_template_filtered, ul_count_filtered, p_template_embedded,
                                      ul_count_embedded) == CKR_OK)
      {
        /*All attributes of input template are consistent with the pre-allocated object*/
        object_found = CK_TRUE;
      }
    }
  }

  /*If object was not found - try with NIST-384 bit verification key*/
  if (object_found == CK_FALSE)
  {
    template_tmp.type = CKA_LABEL;
    template_tmp.pValue = P11_OBJ_LABEL_VER_PUB_KEY_384;

    /*Look for the object corresponding to 384-bit verification key message, 1 single object, no filter on session*/
    if (FindObjectsFromTemplate(CKV_SESSION_HANDLE_ANY, &h_obj, 1, &ul_obj_cnt, &template_tmp, 1) == CKR_OK)
    {
      /* Get a pointer to the template of the object  */
      if (STSAFE_OBJ_GetTemplateFromObjectHandle(&p_template_embedded, &ul_count_embedded, h_obj) == CKR_OK)
      {
        /*Compare embedded referefence object with input template filtered of 'unique' values (e.g. CKA_EC_POINT).*/
        if (STSAFE_OBJ_CompareTemplates(p_template_filtered, ul_count_filtered, p_template_embedded,
                                        ul_count_embedded) == CKR_OK)
        {
          /*All attributes of input template are consistent with the pre-allocated object*/
          object_found = CK_TRUE;
        }
      }
    }
  }

