jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/BootLoader_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
  /* Check if both templates were not ok for the input object*/
  if (object_found == CK_FALSE)
  {
    /* Return: the template specified in input can't be used to create an object for this implementation*/
    return CKR_ATTRIBUTE_TYPE_INVALID;
  }

  /* ======================== Update the pre-allocated object =================== */
  /* Input template is consistent with one of the two pre-allocated objects.
    * Overwrite the CKA_EC_POINT attribute of the pre-allocated object. */

  /* Extract CKA_EC_POINT attribute from input template */
  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_input, CKA_EC_POINT, pTemplate, ulCount) == CKR_OK)
  {
    /* Extract CKA_EC_POINT attribute pointer from pre-allocated object template */
    if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_embedded, CKA_EC_POINT, p_template_embedded,
                                           ul_count_embedded) == CKR_OK)
    {
      /* Check if the pre-allocated object has enough memory to store the new input value*/
      if (p_attribute_input->ulValueLen <= p_attribute_embedded->ulValueLen)
      {
        /* Update the embedded object pValue */
        e_ret_status = STSAFE_OBJ_SetAttributeValue(p_attribute_embedded, p_attribute_input->pValue,
                                                    p_attribute_input->ulValueLen);

      }
      else
      {
        /* The pre-allocated value doesn't have enough memory to store the new value*/
        e_ret_status = CKR_DEVICE_MEMORY;
      }
    }
    else
    {
      /* It means pre-allocated template does not have CKA_EC_POINT attribute - should never get here*/
      e_ret_status = CKR_GENERAL_ERROR;
    }
  }
  else
  {
    /* It means input template does not have CKA_EC_POINT attribute - should never get here*/
    e_ret_status = CKR_ATTRIBUTE_TYPE_INVALID;
  }


  /* if error, return */
  if (e_ret_status != CKR_OK)
  {
    return e_ret_status;
  }

  /* ========== Assign the object to the session ========== */
  if (ObjectSetSession(h_obj, hSession) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

  /* ========== Return the new object handle  ========== */



  /*Return the object handle*/
  *phObject = h_obj;

  return CKR_OK;
}

/**
  * @brief C_CopyObject copies an object, creating a new object for the copy.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession     the session's handle
  * @param  hObject     the object's handle
  * @param  pTemplate     template for the new object
  * @param  ulCount     attributes in template
  * @param  phNewObject     receives handle of copy.
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED
  */
static CK_RV STSAFE_P11_CopyObject(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE hObject, CK_ATTRIBUTE_PTR pTemplate,
                                   CK_ULONG ulCount, CK_OBJECT_HANDLE_PTR phNewObject)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_DestroyObject destroys an object.
  * @note   Delete certificate not supported by this release
  * @param  hSession     the session's handle
  * @param  hObject     the object's handle
  * @retval CK_RV CKR_ACTION_PROHIBITED
  */

CK_RV STSAFE_OBJ_DeleteTemplatePtrFromObjectHandle(CK_OBJECT_HANDLE hObject);

static CK_RV STSAFE_P11_DestroyObject(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE hObject)
{
  return CKR_ACTION_PROHIBITED; /* Valid for certificate*/

}
/**
  * @brief  C_GetObjectSize gets the size of an object in bytes.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession     the session's handle
  * @param  hObject     the object's handle
  * @param  pulSize     receives size of objec
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED
  */
static CK_RV STSAFE_P11_GetObjectSize(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE hObject, CK_ULONG_PTR pulSize)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_GetAttributeValue obtains the value of one or more object attributes
  * @param  hSession     the session's handle
  * @param  hObject     the object's handle
  * @param  pTemplate    specifies attrs; gets vals
  * @param  ulCount     attributes in template
  * @retval CK_RV CKR_ARGUMENTS_BAD, CKR_CRYPTOKI_NOT_INITIALIZED, CKR_SESSION_HANDLE_INVALID,
  *               CKR_SESSION_CLOSED, CKR_OBJECT_HANDLE_INVALID, CKR_FUNCTION_FAILED, CKR_ATTRIBUTE_SENSITIVE,
  *               CKR_ATTRIBUTE_TYPE_INVALID, CKR_BUFFER_TOO_SMALL, CKR_OK.
  */
static CK_RV STSAFE_P11_GetAttributeValue(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE  hObject,
                                          CK_ATTRIBUTE_PTR  pTemplate, CK_ULONG  ulCount)
{
  uint32_t i;
  CK_RV e_ret_status;
  CK_ATTRIBUTE_PTR  p_template_embedded;
  CK_ATTRIBUTE_PTR  p_attribute;
  CK_ULONG  ul_count_embedded;
  CK_ULONG ul_value_len_tmp;

  /* Check input parameters */
  if ((pTemplate == NULL_PTR) || (ulCount == 0UL))
  {
    return CKR_ARGUMENTS_BAD;
  }

  /* ========== Check PKCS11 status and session  ========== */

  /* Check if PKCS11 module has already been initialized */
  if (uInitialized == CK_FALSE)
  {
    return CKR_CRYPTOKI_NOT_INITIALIZED;
  }

  /* Check if the Session handle specified in input is valid */
  if (SessionIsValid(hSession) != CKR_OK)
  {
    return CKR_SESSION_HANDLE_INVALID;
  }

  /* Check if Session is open */
  if (SessionIsOpen(hSession) != CKR_OK)
  {
    return CKR_SESSION_CLOSED;
  }

  /* ========================= Look for the specific object ============================== */

  /* Get a pointer to the template of the embbeded object corresponding to hObject handle specified in input */
  if (STSAFE_OBJ_GetTemplateFromObjectHandle(&p_template_embedded, &ul_count_embedded, hObject) != CKR_OK)
  {
    /*Handle specified is not a valid object*/
    return CKR_OBJECT_HANDLE_INVALID;
  }

  /* ========== Copy embedded object attributes to the template provided in input ========== */
  /*
    * For each (type, pValue, ulValueLen) triple in the template, C_GetAttributeValue performs the following algorithm:
    * 1. If the specified attribute (i.e., the attribute specified by the type field) for the object cannot be
    *    revealed because the object is sensitive or unextractable, then the ulValueLen field in that triple
    *    is modified to hold the value CK_UNAVAILABLE_INFORMATION.
    * 2. Otherwise, if the specified value for the object is invalid (the object does not possess such an
    *    attribute), then the ulValueLen field in that triple is modified to hold the value CK_UNAVAILABLE_INFORMATION.
    * 3. Otherwise, if the pValue field has the value NULL_PTR, then the ulValueLen field is modified to hold the
    *    exact length of the specified attribute for the object.
    * 4. Otherwise, if the length specified in ulValueLen is large enough to hold the value of the specified
    *    attribute for the object,then that attribute is copied into the buffer located at pValue, and the ulValueLen
    *    field is modified to hold the exact length of the attribute.
    * 5. Otherwise, the ulValueLen field is modified to hold the value CK_UNAVAILABLE_INFORMATION.
    */

  /*Init*/
  e_ret_status = CKR_OK;

  /*Loop on all the attributes of input Template*/
  for (i = 0; i < ulCount; i++)
  {
    /* Look for the attribute in the corresponding embedded object */
    if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute, pTemplate[i].type, p_template_embedded,
                                           ul_count_embedded) == CKR_OK)
    {
      /* Check if the attribute is sensitive */
      if (IsAttributeSensitive(pTemplate[i].type, p_template_embedded, ul_count_embedded) == CK_TRUE)
      {
        /* The attribute specified by the type field for the object cannot be revealed because the object is sensitive
         * or unextractable, then the ulValueLen field in that triple is modified to hold
         * the value CK_UNAVAILABLE_INFORMATION.*/
        pTemplate[i].ulValueLen = CK_UNAVAILABLE_INFORMATION;

        /* If case 1 applies to any of the requested attributes, then the call should return the value
         * CKR_ATTRIBUTE_SENSITIVE*/
        e_ret_status = CKR_ATTRIBUTE_SENSITIVE;
      }
      else
      {
        /* Get Value Len*/
        if (GetAttributeValueFromTemplate(NULL_PTR, &ul_value_len_tmp, pTemplate[i].type, p_template_embedded,
                                          ul_count_embedded) != CKR_OK)
        {
          /*Return immediately*/
          return CKR_FUNCTION_FAILED;
        }

        /* Check if inpute template provided a pValue pointer to store the content for that attribute */
        if (pTemplate[i].pValue == NULL_PTR)
        {
          /* If the pValue field has the value NULL_PTR, then the ulValueLen field is modified to hold the exact length
           * of the specified attribute for the object */
          pTemplate[i].ulValueLen = ul_value_len_tmp;
        }
        else
        {
          /* Otherwise, if the length specified in ulValueLen is large enough to hold the value of the specified
           * attribute for the object, then that attribute is
           * copied into the buffer located at pValue, and the ulValueLen field is modified to hold the exact
           * length of the attribute*/
          if (pTemplate[i].ulValueLen >= ul_value_len_tmp)
          {
            if (GetAttributeValueFromTemplate(pTemplate[i].pValue, &pTemplate[i].ulValueLen, pTemplate[i].type,
                                              p_template_embedded,
                                              ul_count_embedded) != CKR_OK)
            {
              /*Return immediately*/
              return CKR_FUNCTION_FAILED;
            }
          }
          else
          {
            /* Otherwise, the ulValueLen field is modified to hold the value CK_UNAVAILABLE_INFORMATION
             * return is CKR_BUFFER_TOO_SMALL */
            pTemplate[i].ulValueLen = CK_UNAVAILABLE_INFORMATION;
            e_ret_status = CKR_BUFFER_TOO_SMALL;
          }
        }
      }
    }
    else
    {
      /* The object does not possess such an attribute,then the ulValueLen field in that triple
       * is modified to hold the value CK_UNAVAILABLE_INFORMATION.*/
      pTemplate[i].ulValueLen = CK_UNAVAILABLE_INFORMATION;

      /* If case 2 applies to any of the requested attributes, then the call should return
       * the value CKR_ATTRIBUTE_TYPE_INVALID*/
      e_ret_status = CKR_ATTRIBUTE_TYPE_INVALID;
    }
  }

  /* Only if none of the return errors applies to any of the requested attributes CKR_OK is returned.*/
  if ((e_ret_status != CKR_ATTRIBUTE_SENSITIVE) && (e_ret_status != CKR_ATTRIBUTE_TYPE_INVALID)
      && (e_ret_status != CKR_BUFFER_TOO_SMALL))
  {
    e_ret_status = CKR_OK;
  }

