jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/BootLoader_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
  /*Check input parameters*/
  if (pMechanism == NULL_PTR)
  {
    return CKR_ARGUMENTS_BAD;
  }

  /* ========== Check PKCS11 status and session  ========== */

  /* Check if PKCS11 module has already been initialized */
  if (uInitialized == CK_FALSE)
  {
    return CKR_CRYPTOKI_NOT_INITIALIZED;
  }

  /* Check if the Session handle specified in input is valid */
  if (SessionIsValid(hSession) != CKR_OK)
  {
    return CKR_SESSION_HANDLE_INVALID;
  }

  /* Check if Session is open */
  if (SessionIsOpen(hSession) != CKR_OK)
  {
    return CKR_SESSION_CLOSED;
  }

  /* ========== Check active operation status ========== */

  /* Check if there is already an operation active */
  if (SessionOperationIsActive(hSession) == CKR_OK)
  {
    return CKR_OPERATION_ACTIVE;
  }

  /* ========== Get the template of the object handle specified in input ========== */

  /* Get a pointer to the template of the embbeded object corresponding to hObject handle specified in input */
  if (STSAFE_OBJ_GetTemplateFromObjectHandle(&p_template_embedded, &ul_count_embedded, hObject) != CKR_OK)
  {
    return CKR_KEY_HANDLE_INVALID;
  }

  /* ========== Check CKA_ALLOWED_MECHANISMS attribute ========== */

  /* Extract CKA_ALLOWED_MECHANISMS attribute from the template */
  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_ALLOWED_MECHANISMS, p_template_embedded,
                                         ul_count_embedded) != CKR_OK)
  {
    return CKR_KEY_HANDLE_INVALID;
  }

  /*Check if the mechanism type specified in input is allowed, if not return CKR_MECHANISM_INVALID*/
  if (IsMechanismTypeAllowed((CK_MECHANISM_TYPE)(pMechanism->mechanism), (CK_MECHANISM_PTR)p_attribute_tmp->pValue,
                             p_attribute_tmp->ulValueLen) != CK_TRUE)
  {
    return CKR_MECHANISM_INVALID;
  }

  /* ========== Check CKA_CLASS attribute ========== */

  /* Extract CKA_CLASS attribute from the template */
  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_CLASS, p_template_embedded, ul_count_embedded) != CKR_OK)
  {
    return CKR_KEY_HANDLE_INVALID;
  }

  /*Check if CKA_CLASS == CKO_PRIVATE_KEY, if not return CKR_KEY_TYPE_INCONSISTENT*/
  if (*((CK_OBJECT_CLASS *)(p_attribute_tmp->pValue)) != CKO_PRIVATE_KEY)
  {
    return CKR_KEY_TYPE_INCONSISTENT;
  }

  /* ========== Check CKA_KEY_TYPE attribute ========== */

  /* Extract CKA_KEY_TYPE attribute from the template */
  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_KEY_TYPE, p_template_embedded,
                                         ul_count_embedded) != CKR_OK)
  {
    return CKR_KEY_HANDLE_INVALID;
  }

  /*Check if CKA_KEY_TYPE == CKK_EC, if not return CKR_KEY_TYPE_INCONSISTENT*/
  if (*((CK_KEY_TYPE *)(p_attribute_tmp->pValue)) != CKK_EC)
  {
    return CKR_KEY_TYPE_INCONSISTENT;
  }

  /* ========== Check CKA_SIGN attribute ========== */

  /* Extract CKA_SIGN attribute from the template */
  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_SIGN, p_template_embedded, ul_count_embedded) != CKR_OK)
  {
    return CKR_KEY_HANDLE_INVALID;
  }

  /*Check if CKA_SIGN == CK_TRUE, if not return CKR_KEY_FUNCTION_NOT_PERMITTED*/
  if (*((CK_BBOOL *)(p_attribute_tmp->pValue)) != CK_TRUE)
  {
    return CKR_KEY_FUNCTION_NOT_PERMITTED;
  }

  /* ========== Store the object selected for the operation ========== */
  if (SessionOperationSetObjects(hSession, &hObject, 1U) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

  return CKR_OK;
}


/**
  * @brief  C_Sign signs (encrypts with private key) data in a single
  *         part, where the signature is (will be) an appendix to the
  *         data, and plaintext cannot be recovered from the signature.
  * @note   This function uses the convention for functions returing output in a variable-length buffer in producing
  *         output.
  *         Two of the arguments to the function are a pointer to the output buffer (say pBuf) and a pointer to a
  *         location which will hold the length of the output produced (say pulBufLen).
  *         There are two ways for an application to call such a function
  *         1.  If pBuf is NULL_PTR, then all that the function does is return (in *pulBufLen) a number of bytes which
  *             would suffice to hold the cryptographic output produced from the input to the function.
  *             This number may somewhat exceed the precise number of bytes needed,
  *             but should not exceed it by a large amount.  CKR_OK is returned by the function.
  *         2.  If pBuf is not NULL_PTR, then *pulBufLen MUST contain the size in bytes of the buffer pointed to by
  *             pBuf.
  *             If that buffer is large enough to hold the cryptographic output produced from the input to the
  *             function, then that cryptographic output is placed there,
  *             and CKR_OK is returned by the function.  If the buffer is not large enough, then CKR_BUFFER_TOO_SMALL
  *             is returned.
  *         In either case, *pulBufLen is set to hold the exact number of bytes needed to hold the cryptographic output
  *         produced from the input to the function.
  * @param  hSession,        the session's handle
  * @param  pData,           the data to sign
  * @param  ulDataLen,       count of bytes to sign
  * @param  pSignature,      gets the signature
  * @param  pulSignatureLen  gets signature length
  * @retval CK_RV CKR_ARGUMENTS_BAD,CKR_CRYPTOKI_NOT_INITIALIZED, CKR_SESSION_HANDLE_INVALID,
  *               CKR_SESSION_CLOSED, CKR_OPERATION_NOT_INITIALIZED, CKR_FUNCTION_FAILED, CKR_DATA_LEN_RANGE,
  *               CKR_BUFFER_TOO_SMALL, CKR_OK.
  */
static CK_RV STSAFE_P11_Sign(CK_SESSION_HANDLE     hSession, CK_BYTE_PTR pData,
                             CK_ULONG  ulDataLen, CK_BYTE_PTR  pSignature, CK_ULONG_PTR pulSignatureLen)
{
  CK_ATTRIBUTE_PTR p_attribute_tmp, p_template;
  CK_OBJECT_HANDLE h_object;
  CK_ULONG ul_count;
  uint32_t ul_data_len;
  uint32_t ul_sign_out_len;
  uint32_t ul_r_length;
  uint32_t ul_s_length;
  uint8_t u_sign_in_len;
  StSafeA_LVBuffer_t signature;
  StSafeA_HashTypes_t e_hash_type;

