jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/BootLoader_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
  /* Prepare the curve parameters  */
  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_EC_PARAMS, p_template, ul_count) != CKR_OK)
  {
    SessionOperationFinish(hSession);
    return CKR_FUNCTION_FAILED;
  }

  /*Extract curve and data len from key OID */
  if (memcmp(p_attribute_tmp->pValue, STSAFEA_ECC_CURVE_OID_NIST_P_256_DER, p_attribute_tmp->ulValueLen) == 0)
  {
    /* NIST P-256*/
    curve = STSAFEA_NIST_P_256;
    ul_data_len =  STSAFEA_SHA_256_LENGTH;

  }
  else if (memcmp(p_attribute_tmp->pValue, STSAFEA_ECC_CURVE_OID_NIST_P_384_DER, p_attribute_tmp->ulValueLen) == 0)
  {
    /* NIST P-384*/
    curve = STSAFEA_NIST_P_384;
    ul_data_len = STSAFEA_SHA_384_LENGTH;
  }
  else
  {
    /* It should never get here */
    SessionOperationFinish(hSession);
    return CKR_FUNCTION_FAILED;
  }


  /* ========== Check signature len ========== */
  if (ulSignatureLen != (ul_data_len * 2UL))
  {
    SessionOperationFinish(hSession);
    return CKR_SIGNATURE_LEN_RANGE;
  }


  /* ========== Extract CKA_EC_POINT attribute  ========== */


  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_EC_POINT, p_template, ul_count) != CKR_OK)
  {
    SessionOperationFinish(hSession);
    return CKR_FUNCTION_FAILED;
  }

  /* Decode and check data format of embedded object CKE_EC_POINT - if not ok return CKR_DATA_INVALID*/
  /* Note: EC Point formatting for Verify is only DER-encoding of ASN1 X9.62 EC Point value Q*/
  if (DecodeDerASN1UncompressedEcPoint(p_public_data_raw, &ul_public_data_raw_len, p_attribute_tmp->pValue,
                                       p_attribute_tmp->ulValueLen) != CKR_OK)
  {
    SessionOperationFinish(hSession);
    return CKR_DATA_INVALID;
  }

  /* ========== Check data len ========== */
  if ((ulDataLen != ul_data_len) || (ulDataLen != (ul_public_data_raw_len / 2UL)))
  {
    SessionOperationFinish(hSession);
    return CKR_DATA_LEN_RANGE;
  }

  /* ========== Convert Data to STSAFE types : Public Key  ========== */

  /* Prepare Public Key X Coordinate Value */
  pub_x.Length = (uint16_t)(ul_public_data_raw_len / 2UL);
  (void)memcpy(pub_x.Data, &p_public_data_raw[0], pub_x.Length);

  /* Prepare Public Key Y Coordinate Value */
  pub_y.Length = (uint16_t)(ul_public_data_raw_len / 2UL);
  (void)memcpy(pub_y.Data, &p_public_data_raw[pub_x.Length], pub_y.Length);

  /* ========== Convert Data to STSAFE types : Signature  ========== */

  /* Prepare Signature R Value */
  sig_r.Length = (uint16_t)(ulSignatureLen / 2UL);
  (void)memcpy(sig_r.Data, &pSignature[0], sig_r.Length);

  /* Prepare Signature S Value */
  sig_s.Length = (uint16_t)(ulSignatureLen / 2UL);
  (void)memcpy(sig_s.Data, &pSignature[sig_r.Length], sig_s.Length);

  /* ========== Convert Data to STSAFE types : Hash  ========== */

  /* Prepare HASH Value */
  hash.Length = (uint16_t)ul_data_len;
  (void)memcpy(hash.Data, pData, hash.Length);

  /* ========== Verify Signature using STSAFE-A1xx ========== */

  /* Verify with STSAFE-A1xx */
  if (StSafeA_VerifyMessageSignature(&hStSafe, curve, &pub_x, &pub_y, &sig_r, &sig_s, &hash, &verif,
		  STSAFEA_MAC_HOST_RMAC) != STSAFEA_OK)
  {
    SessionOperationFinish(hSession);
    return CKR_FUNCTION_FAILED;
  }

  /* Check Signature validity */
  if (verif.SignatureValidity == 0U)
  {
    SessionOperationFinish(hSession);
    return CKR_SIGNATURE_INVALID;
  }

  /* ========== Mark operation as finished ========== */
  SessionOperationFinish(hSession);

  return CKR_OK;
}

/**
  * @brief  C_VerifyUpdate continues a multiple-part verification
  *         operation, where the signature is an appendix to the data,
  *         and plaintext cannot be recovered from the signature.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession,  the session's handle
  * @param  pPart,     signed data
  * @param  ulPartLen  length of signed data
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_VerifyUpdate(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pPart, CK_ULONG ulPartLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_VerifyFinal finishes a multiple-part verification
  *         operation, checking the signature.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession,       the session's handle
  * @param  pSignature,     signature to verify
  * @param  ulSignatureLen  signature length
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_VerifyFinal(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pSignature, CK_ULONG ulSignatureLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief   C_VerifyRecoverInit initializes a signature verification
  * operation, where the data is recovered from the signature.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param hSession,    the session's handle
  * @param pMechanism,  the verification mechanism
  * @param hKey         verification key
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_VerifyRecoverInit(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR pMechanism,
                                          CK_OBJECT_HANDLE hKey)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_VerifyRecover verifies a signature in a single-part
  * operation, where the data is recovered from the signature.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param hSession,        the session's handle
  * @param pSignature,      signature to verify
  * @param ulSignatureLen,  signature length
  * @param pData,           gets signed data
  * @param pulDataLen       gets signed data len
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_VerifyRecover(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pSignature, CK_ULONG ulSignatureLen,
                                      CK_BYTE_PTR pData, CK_ULONG_PTR pulDataLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_DigestEncryptUpdate continues a multiple-part digesting
  * and encryption operation.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param hSession,            session's handle
  * @param pPart,               the plaintext data
  * @param ulPartLen,           plaintext length
  * @param pEncryptedPart,      gets ciphertext
  * @param pulEncryptedPartLen  gets c-text length
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_DigestEncryptUpdate(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pPart, CK_ULONG ulPartLen,
                                            CK_BYTE_PTR pEncryptedPart, CK_ULONG_PTR pulEncryptedPartLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief   C_DecryptDigestUpdate continues a multiple-part decryption and
  * digesting operation.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param hSession,            session's handle
  * @param pEncryptedPart,      ciphertext
  * @param ulEncryptedPartLen,  ciphertext length
  * @param pPart,               gets plaintext
  * @param pulPartLen           gets plaintext len
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_DecryptDigestUpdate(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pEncryptedPart,
                                            CK_ULONG ulEncryptedPartLen, CK_BYTE_PTR pPart, CK_ULONG_PTR pulPartLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_SignEncryptUpdate continues a multiple-part signing and
  * encryption operation.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param hSession,            session's handle
  * @param pPart,               the plaintext data
  * @param ulPartLen,           plaintext length
  * @param pEncryptedPart,      gets ciphertext
  * @param pulEncryptedPartLen  gets c-text length
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_SignEncryptUpdate(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pPart, CK_ULONG ulPartLen,
                                          CK_BYTE_PTR pEncryptedPart, CK_ULONG_PTR pulEncryptedPartLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief   C_DecryptVerifyUpdate continues a multiple-part decryption and
  * verify operation.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param hSession,            session's handle
  * @param pEncryptedPart,      ciphertext
  * @param ulEncryptedPartLen,  ciphertext length
  * @param pPart,               gets plaintext
  * @param pulPartLen           gets p-text length
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_DecryptVerifyUpdate(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pEncryptedPart,
                                            CK_ULONG ulEncryptedPartLen, CK_BYTE_PTR pPart, CK_ULONG_PTR pulPartLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_GenerateKey generates a secret key, creating a new key
  * object.
  * @param    hSession,    the session's handle
  * @param    pMechanism,  key generation mech.
  * @param    pTemplate,   template for new key
  * @param    ulCount,     # of attrs in template
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_GenerateKey(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR pMechanism, CK_ATTRIBUTE_PTR pTemplate,
                                    CK_ULONG ulCount, CK_OBJECT_HANDLE_PTR phKey)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}


/**
  * @brief  C_GenerateKeyPair generates a public-key/private-key pair,
  *         creating new key objects.
  * @note   This implementation supports only CKM_EC_KEY_PAIR_GEN generation mechanism.
  * @param    hSession,                    session handle
  * @param    pMechanism,                  key-gen mech.
  * @param    pPublicKeyTemplate,          template for pub. key
  * @param    ulPublicKeyAttributeCount,   # pub. attrs.
  * @param    pPrivateKeyTemplate,         template for priv. key
  * @param    ulPrivateKeyAttributeCount,  # priv.  attrs.
  * @retval CK_RV CKR_ARGUMENTS_BAD,CKR_CRYPTOKI_NOT_INITIALIZED, CKR_SESSION_HANDLE_INVALID,CKR_SESSION_CLOSED,
  *               CKR_MECHANISM_INVALID, CKR_ATTRIBUTE_VALUE_INVALID, CKR_ATTRIBUTE_TYPE_INVALID, CKR_FUNCTION_FAILED,
  *               CKR_TEMPLATE_INCONSISTENT, CKR_DEVICE_MEMORY,CKR_OK.
  */
static CK_RV STSAFE_P11_GenerateKeyPair(CK_SESSION_HANDLE    hSession,
                                        CK_MECHANISM_PTR     pMechanism,
                                        CK_ATTRIBUTE_PTR     pPublicKeyTemplate,
                                        CK_ULONG             ulPublicKeyAttributeCount,
                                        CK_ATTRIBUTE_PTR     pPrivateKeyTemplate,
                                        CK_ULONG             ulPrivateKeyAttributeCount,
                                        CK_OBJECT_HANDLE_PTR phPublicKey,
                                        CK_OBJECT_HANDLE_PTR phPrivateKey)
{
  CK_RV e_ret_status;
  CK_OBJECT_HANDLE h_pub_obj, h_prv_obj;
  CK_ULONG ul_obj_cnt, ul_pub_count_embedded, ul_count_filtered, u_len_tmp, ul_prv_count_embedded, \
  ul_public_data_raw_len;
  CK_ATTRIBUTE_PTR  p_pub_template_embedded, p_prv_template_embedded, p_attribute_tmp,p_attribute;
  CK_ATTRIBUTE  template_tmp, p_template_filtered[STSAFE_P11_MAX_TEMPLATE_SIZE];
  CK_BYTE  p_public_data_raw[2UL * STSAFEA_SHA_384_LENGTH];
  StSafeA_CurveId_t curve;
  StSafeA_LVBuffer_t pub_x;
  StSafeA_LVBuffer_t pub_y;
  uint8_t point_reprensentation_id,slot_id,in_authorization_flags = 0;

