jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/BootLoader_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
  /* ========== Extract CKA_EXT_TOKEN_PRVKEY_SLOT  ========== */
  /* This vendor defined attribute links one PKCS11 object to a specific feature of STSAFE*/

  /* Extract from the template the external token slot*/
  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_EXT_TOKEN_PRVKEY_SLOT, p_prv_template_embedded,
                                         ul_prv_count_embedded) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

  /* ========== Generate Key Pair with STSAFE  ========== */
  /* Note:  Public Key will be returned to the application, while Private Key is stored securely and never
    *       leaves STSAFE. Curve type depends on CKA_EC_PARAM attributes specified in the configuration */

  slot_id=(*((CK_EXT_TOKEN_PRVKEY_SLOT *) (p_attribute_tmp->pValue)));

  if (slot_id == 0xFF)
  {
    in_authorization_flags=(STSAFEA_PRVKEY_MODOPER_AUTHFLAG_KEY_ESTABLISHEN);
  }
  else
  {
    in_authorization_flags=(STSAFEA_PRVKEY_MODOPER_AUTHFLAG_MSG_DGST_SIGNEN);
  }

  if (StSafeA_GenerateKeyPair(&hStSafe, slot_id, 0xFFFFU, 1U,
                              in_authorization_flags,
                              curve, &point_reprensentation_id,
                              STSAFEA_GET_XYRS_LEN_FROM_CURVE(curve),
                              &pub_x, &pub_y, STSAFEA_MAC_HOST_CMAC) != STSAFEA_OK)

  {
    return CKR_FUNCTION_FAILED;
  }

  /* We enable private key for all sessions */

  /* Check if object had CKA_VENDOR_OBJECT_AVAILABILITY, then we need to activate the object has available   */
  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_VENDOR_OBJECT_AVAILABILITY, p_prv_template_embedded,
                                         ul_prv_count_embedded) == CKR_OK)
  {
    CK_BBOOL bValue = CK_TRUE;
    e_ret_status = STSAFE_OBJ_SetAttributeValue(p_attribute_tmp, (CK_BYTE*)&bValue, sizeof(CK_BBOOL));
  }

  /* ========== Prepare output data  ========== */

  /* Comput data len  */
  ul_public_data_raw_len = (uint32_t)pub_x.Length;
  ul_public_data_raw_len += (uint32_t) pub_y.Length;

  /* Copy Public Key X coordinate */
  (void)memcpy(&p_public_data_raw[0U], pub_x.Data, pub_x.Length);

  /* Copy Public Key Y coordinate */
  (void)memcpy(&p_public_data_raw[pub_x.Length], pub_y.Data, pub_y.Length);

  /* ========== Update CKA_EC_POINT attribute of the pre-allocated object ========== */

  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_EC_POINT, p_pub_template_embedded,
                                         ul_pub_count_embedded) != CKR_OK)
  {
    return CKR_ATTRIBUTE_TYPE_INVALID;
  }

  /* ========== Check if pre-allocated space is enough to store the new public key  ========== */


  if (ul_public_data_raw_len > p_attribute_tmp->ulValueLen)
  {
    return CKR_DEVICE_MEMORY;
  }

  /* ========== Encode and update CKA_EC_POINT  ========== */

  /*Encode raw data into DER x962 EC Point format expected by PKCS11 spec*/
  /*Note: len value is local only - can't overwrite the ulValueLen constant value in flash for this object*/
  if (EncodeRawToDerASN1UncompressedEcPoint(p_attribute_tmp->pValue, &u_len_tmp, p_public_data_raw,
                                            ul_public_data_raw_len) != CKR_OK)
  {
    return CKR_ATTRIBUTE_VALUE_INVALID;
  }

  /* ========== Update attribute : Pub key can be enabled for all sessions  ========== */

  ObjectSetVendorObjectAvailability(h_pub_obj, CK_TRUE);
  ObjectSetVendorObjectAvailability(h_prv_obj, CK_TRUE);

  /* ========== Return object handles ========== */

  /*return object handles*/
  *phPublicKey = h_pub_obj;
  *phPrivateKey = h_prv_obj;

  return CKR_OK;
}

/**
  * @brief  C_WrapKey wraps (i.e., encrypts) a key.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param hSession,        the session's handle
  * @param pMechanism,      the wrapping mechanism
  * @param hWrappingKey,    wrapping key
  * @param hKey,            key to be wrapped
  * @param pWrappedKey,     gets wrapped key
  * @param pulWrappedKeyLen gets wrapped key size
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_WrapKey(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR pMechanism, CK_OBJECT_HANDLE hWrappingKey,
                                CK_OBJECT_HANDLE hKey, CK_BYTE_PTR pWrappedKey, CK_ULONG_PTR pulWrappedKeyLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}

/**
  * @brief   C_UnwrapKey unwraps (decrypts) a wrapped key, creating a new key object.
  * @param    hSession          session's handle
  * @param    pMechanism        unwrapping mech.
  * @param    hUnwrappingKey    unwrapping key
  * @param    pWrappedKey       the wrapped key
  * @param    ulWrappedKeyLen   wrapped key len
  * @param    pTemplate         new key template
  * @param    ulAttributeCount  template length
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_UnwrapKey(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR pMechanism,
                                  CK_OBJECT_HANDLE hUnwrappingKey, CK_BYTE_PTR pWrappedKey, CK_ULONG ulWrappedKeyLen,
                                  CK_ATTRIBUTE_PTR pTemplate,
                                  CK_ULONG ulAttributeCount, CK_OBJECT_HANDLE_PTR phKey)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}


/**
  * @brief  C_DeriveKey derives a key from a base key, creating a new key object.
  * @note   This implementation only supports ECDH1 with CKD_NULL parameter derivation.
  *         The key derivation function CKD_NULL produces a raw shared secret value.
  *         Diffie-Hellman derivation will be computed using the ephemeral private key stored in
  *         STSAFE and generated with C_GenerateKeyPair in combination with a public key provided
  *         in input through pMechanism.
  * @param  hSession          session's handle
  * @param  pMechanism        key deriv. mech.
  * @param  hBaseKey          base key
  * @param  pTemplate         new key template
  * @param  ulAttributeCount  template length
  * @param  phKey             gets derived key object
  * @retval CK_RV CKR_ARGUMENTS_BAD,CKR_CRYPTOKI_NOT_INITIALIZED, CKR_SESSION_HANDLE_INVALID,CKR_SESSION_CLOSED,
  *               CKR_MECHANISM_INVALID, CKR_MECHANISM_PARAM_INVALID, CKR_DOMAIN_PARAMS_INVALID,
  *               CKR_ATTRIBUTE_VALUE_INVALID,CKR_ATTRIBUTE_TYPE_INVALID, CKR_TEMPLATE_INCONSISTENT,
  *               CKR_ATTRIBUTE_READ_ONLY, CKR_FUNCTION_FAILED, CKR_DEVICE_MEMORY, CKR_OK.
  */
static CK_RV STSAFE_P11_DeriveKey(CK_SESSION_HANDLE  hSession, CK_MECHANISM_PTR  pMechanism,
                                  CK_OBJECT_HANDLE   hBaseKey, CK_ATTRIBUTE_PTR     pTemplate,
                                  CK_ULONG   ulAttributeCount, CK_OBJECT_HANDLE_PTR phKey)
{
  CK_RV e_ret_status;
  CK_ECDH1_DERIVE_PARAMS_PTR p_params;
  CK_OBJECT_HANDLE h_obj_shrd_secret_x;
  CK_ATTRIBUTE  template_tmp, p_template_filtered[STSAFE_P11_MAX_TEMPLATE_SIZE];
  CK_ATTRIBUTE_PTR p_attribute_tmp, p_template_base, p_template_secret;
  CK_ULONG  ul_count_base, ul_count_secret, ul_public_data_raw_len, prv_key_len, ul_obj_cnt, ul_count_filtered;
  CK_BYTE  p_public_data_raw[2UL * STSAFEA_SHA_384_LENGTH];

