jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/BootLoader_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
  STSAFEA_STATIC_ALLOCATE_LV_BUFFER_VAR(StSafeA_LVBuffer_t, pub_x,
                                        STSAFEA_XYRS_ECDSA_SHA384_LENGTH);  /* Using 384 max len. */
  STSAFEA_STATIC_ALLOCATE_LV_BUFFER_VAR(StSafeA_LVBuffer_t, pub_y,
                                        STSAFEA_XYRS_ECDSA_SHA384_LENGTH);  /* Using 384 max len. */

  StSafeA_SharedSecretBuffer_t shared_secret;
  uint8_t SharedKey_Data[STSAFEA_XYRS_ECDSA_SHA384_LENGTH];
  shared_secret.SharedKey.Data   = SharedKey_Data;

  /*Check input parameters*/
  if ((pMechanism == NULL_PTR) || (pTemplate == NULL_PTR) || (phKey == NULL_PTR) || (ulAttributeCount == 0UL))
  {
    return CKR_ARGUMENTS_BAD;
  }

  /* ========== Check PKCS11 status and session  ========== */

  /* Check if PKCS11 module has already been initialized */
  if (uInitialized == CK_FALSE)
  {
    return CKR_CRYPTOKI_NOT_INITIALIZED;
  }

  /* Check if the Session handle specified in input is valid */
  if (SessionIsValid(hSession) != CKR_OK)
  {
    return CKR_SESSION_HANDLE_INVALID;
  }

  /* Check if Session is open */
  if (SessionIsOpen(hSession) != CKR_OK)
  {
    return CKR_SESSION_CLOSED;
  }

  /* ========== Check Mechanism Params specified in input ========== */
  if (pMechanism->pParameter == NULL_PTR)
  {
    return CKR_MECHANISM_INVALID;
  }

  /* Assign mechanism params */
  p_params = (CK_ECDH1_DERIVE_PARAMS_PTR)pMechanism->pParameter;

  /* Check KDF parameter*/
  /* Note: In this implementation only CKD_NULL (KDF = NULL_PTR) is supported */
  if (p_params->kdf != CKD_NULL)
  {
    return CKR_MECHANISM_PARAM_INVALID;
  }

  /* Check if a public key was specified in input */
  /* With the key derivation function CKD_NULL, pSharedData must be NULL and ulSharedDataLen must be zero*/
  if ((p_params->pPublicData == NULL_PTR) || (p_params->pSharedData != NULL_PTR) || (p_params->ulSharedDataLen != 0UL))
  {
    return CKR_DOMAIN_PARAMS_INVALID;
  }

  /* ========== Parse of the other party's EC public key value  ========== */

  /* A token MAY support accepting this value as a DER-encoded ECPoint (as per section E.6 of [ANSI X9.62]) i.e. the
   * same as a CKA_EC_POINT encoding. */
  if (DecodeDerASN1UncompressedEcPoint(p_public_data_raw, &ul_public_data_raw_len, p_params->pPublicData,
                                       p_params->ulPublicDataLen) != CKR_OK)
  {
    /*A token MUST be able to accept this value encoded as a raw octet string (as per section A.5.2 of [ANSI X9.62]).*/
    if (DecodeDerASN1OctetString(p_public_data_raw, &ul_public_data_raw_len, p_params->pPublicData,
                                 p_params->ulPublicDataLen) != CKR_OK)
    {
      return CKR_DOMAIN_PARAMS_INVALID;
    }
  }


  /* ========== Parse Base Key ========== */
  /* Note: In this implementation, base key is the private key used for Diffie-Hellman shared secret computation*/

  /* Get a pointer to the object template using hBaseKey specified in input */
  if (STSAFE_OBJ_GetTemplateFromObjectHandle(&p_template_base, &ul_count_base, hBaseKey) != CKR_OK)
  {
    return CKR_KEY_HANDLE_INVALID;
  }

  /* ========== Extract CKA_ALLOWED_MECHANISMS attribute  ========== */

  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_ALLOWED_MECHANISMS, p_template_base,
                                         ul_count_base) != CKR_OK)
  {
    return CKR_KEY_HANDLE_INVALID;
  }

  /* Check if the mechanism specified in input is valid for the Base key  */
  if (IsMechanismTypeAllowed(pMechanism->mechanism, p_attribute_tmp->pValue, p_attribute_tmp->ulValueLen) != CK_TRUE)
  {
    return CKR_MECHANISM_INVALID;
  }

  /* ========== Check CKA_EC_PARAMS attribute ========== */

  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_EC_PARAMS, p_template_base, ul_count_base) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

  /*Extract curve and data len from key OID */
  if (memcmp(p_attribute_tmp->pValue, STSAFEA_ECC_CURVE_OID_NIST_P_256_DER, p_attribute_tmp->ulValueLen) == 0)
  {
    /* NIST P-256*/
    prv_key_len = STSAFEA_SHA_256_LENGTH * 2UL;

  }
  else if (memcmp(p_attribute_tmp->pValue, STSAFEA_ECC_CURVE_OID_NIST_P_384_DER, p_attribute_tmp->ulValueLen) == 0)
  {
    /* NIST P-384*/
    prv_key_len = STSAFEA_SHA_384_LENGTH * 2UL;

  }
  else
  {
    /* It should never get here */
    return CKR_KEY_HANDLE_INVALID;
  }

  /* ========== Check Key len consistency ========== */
  if (prv_key_len != ul_public_data_raw_len)
  {
    return CKR_DOMAIN_PARAMS_INVALID;
  }


  /* ========== Secret Key  ========== */
  /* Note: In this implementation we only support key derivation of a shared secret on a specific pre-allocated object.
    *      Each call to DeriveKey will overwrite this object.
    */

  template_tmp.type = CKA_LABEL;
  template_tmp.pValue = P11_OBJ_LABEL_DH_SECRET_X;

  /*Look for the object corresponding to P11_OBJ_LABEL_DH_SECRET_X, 1 single object*/
  if (FindObjectsFromTemplate(CKV_SESSION_HANDLE_ANY, &h_obj_shrd_secret_x, 1, &ul_obj_cnt, &template_tmp, 1) != CKR_OK)
  {
    return CKR_ATTRIBUTE_VALUE_INVALID;
  }

  /* Get a pointer to the object  */
  if (STSAFE_OBJ_GetTemplateFromObjectHandle(&p_template_secret, &ul_count_secret, h_obj_shrd_secret_x) != CKR_OK)
  {
    return CKR_ATTRIBUTE_VALUE_INVALID;
  }

  /* ========== Check selected object against reference template  ========== */
  /* Note: Since this implementation doesn't support dynamic memory allocation, the template specified in input will
    *       have to match pre-allocated objects. The only value that can be different is CKA_VALUE, the actual value
    *       of the shared secret key, that is unique per key.
    *       Filter attributes so that they will not be considered when looking and comparing the template with
    *       pre-allocated objects.
    */
  CK_ATTRIBUTE attribute_filter[] =  { {CKA_VALUE, NULL_PTR, 0UL}  } ;

  /*Filter template*/
  if (STSAFE_OBJ_FilterTemplate(p_template_filtered, &ul_count_filtered, pTemplate, ulAttributeCount, attribute_filter,
                                sizeof(attribute_filter) / sizeof(attribute_filter[0])) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

  /* Compare embedded referefence object with input template filtered of 'unique' values (e.g. CKA_VALUE).*/
  e_ret_status = STSAFE_OBJ_CompareTemplates(p_template_filtered, ul_count_filtered, p_template_secret,
                                             ul_count_secret);

  if (e_ret_status != CKR_OK)
  {
    return e_ret_status;
  }

  /* ========== Convert Data to STSAFE types : Other Party's Public Key ========== */

  /* Extract X coordinate from public key specified as mechanism param*/
  pub_x.Length = (uint16_t)(ul_public_data_raw_len / 2UL);
  (void)memcpy(pub_x.Data, p_public_data_raw, pub_x.Length);

  /* Extract Y coordinate from public key specified as mechanism param*/
  pub_y.Length = (uint16_t)(ul_public_data_raw_len / 2UL);
  (void)memcpy(pub_y.Data, &p_public_data_raw[pub_x.Length], pub_y.Length);

  /* ========== Check CKA_EXT_TOKEN_PRVKEY_SLOT attribute========== */
  /* This vendor defined attribute links one PKCS11 object to a specific feature of STSAFE*/

  /* Extract from the template the external token slot*/
  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_EXT_TOKEN_PRVKEY_SLOT, p_template_base,
                                         ul_count_base) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

  /* ========== Compute DH shared secret X coordinate  ========== */

  /* STSAFE Establish Key */
#ifdef STSAFE_A100
  if (StSafeA_EstablishKey(&hStSafe, __STSAFEA_GET_SLOT_ID_FROM_CK(p_attribute_tmp->pValue), &pub_x, &pub_y,
                           STSAFEA_XYRS_ECDSA_SHA256_LENGTH, &shared_secret, STSAFEA_MAC_HOST_CMAC,
                           STSAFEA_ENCRYPTION_RESPONSE) != STSAFEA_OK)
#else
  if (StSafeA_EstablishKey(&hStSafe, __STSAFEA_GET_SLOT_ID_FROM_CK(p_attribute_tmp->pValue), &pub_x, &pub_y,
                           STSAFEA_XYRS_ECDSA_SHA256_LENGTH, &shared_secret, STSAFEA_MAC_HOST_CMAC,
                           STSAFEA_ENCRYPTION_NONE) != STSAFEA_OK)
#endif
{
    return CKR_FUNCTION_FAILED;
  }

  /* ========== Update CKA_VALUE attribute of the embedded object ========== */

  /* Extract CKA_VALUE attribute from the template of the embedded object*/
  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_VALUE, p_template_secret, ul_count_secret) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

