jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/BootLoader_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
  /*Check input parameters*/
  if (SessionIsValid(hSession) != CKR_OK)
  {
    return CKR_SESSION_HANDLE_INVALID;
  }

  /*Adapt Session handle to session index*/
  ul_session_index = hSession - STSAFE_P11_SESSION_INDEX_OFFSET;

  /* Init operations data */
  if (pObject != NULL_PTR)
  {
    (void)memcpy(a_SessionList[ul_session_index].OperationObjects, pObject, ulCount * sizeof(CK_OBJECT_HANDLE));

    a_SessionList[ul_session_index].ulOperationObjectsCount = ulCount;
  }

  /* Mark operation as active */
  a_SessionList[ul_session_index].OperationActive = CK_TRUE;

  return CKR_OK;
}

/**
  * @brief  Get params of active operation.
  * @param  hSession     the session handle
  * @param  pTemplate     gets the operation template
  * @param  pulCount      gets the number of attributes in the template
  * @param  Mechanism     gets the operation mechanism
  * @retval CK_RV CKR_ARGUMENTS_BAD, CKR_OK.
  */
static CK_RV    SessionOperationGetObjects(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE_PTR pObject,
                                           CK_ULONG ulMaxObjectCount, CK_ULONG_PTR pulObjectCount)
{
  CK_ULONG ul_session_index;
  uint32_t i;

  /*Check input parameters*/
  if (pulObjectCount == NULL)
  {
    return CKR_ARGUMENTS_BAD;
  }

  /*Check input parameters*/
  if (SessionIsValid(hSession) != CKR_OK)
  {
    return CKR_SESSION_HANDLE_INVALID;
  }

  /*Adapt Session handle to session index*/
  ul_session_index = hSession - STSAFE_P11_SESSION_INDEX_OFFSET;

  /*Go through the list of stored objects*/
  i = 0U;

  while ((i < a_SessionList[ul_session_index].ulOperationObjectsCount) && (i < ulMaxObjectCount))
  {
    /* Retrieve stored object handles */
    if (pObject != NULL_PTR)
    {
      pObject[i] = a_SessionList[ul_session_index].OperationObjects[i];
    }

    i++;
  }

  /* Assing the number of objects*/
  *pulObjectCount = i;


  return CKR_OK;

}

/**
  * @brief  Finalize an operation for a session.
  * @param  hSession     the session handle
  * @retval CK_RV CKR_OK.
  */
static CK_RV    SessionOperationFinish(CK_SESSION_HANDLE hSession)
{
  CK_ULONG ul_session_index;

  /*Check input parameters*/
  if (SessionIsValid(hSession) != CKR_OK)
  {
    return CKR_SESSION_HANDLE_INVALID;
  }

  /*Adapt Session handle to session index*/
  ul_session_index = hSession - STSAFE_P11_SESSION_INDEX_OFFSET;

  /* Reset all operations data */
  (void)memset(a_SessionList[ul_session_index].OperationObjects, 0U,
               sizeof(CK_OBJECT_HANDLE) * sizeof(a_SessionList[ul_session_index].OperationObjects) /
               (sizeof(a_SessionList[ul_session_index].OperationObjects[0U])));
  a_SessionList[ul_session_index].ulOperationObjectsCount = 0UL;

  /* Mark operation as not active */
  a_SessionList[ul_session_index].OperationActive = CK_FALSE;

  return CKR_OK;
}

/**
  * @brief  Assing an object to a session.
  * @param  hObject    the object handle
  * @param  hSession   the session handle
  * @retval CK_RV CKR_SESSION_HANDLE_INVALID, CKR_GENERAL_ERROR, CKR_OK.
  */
static CK_RV    ObjectSetSession(CK_OBJECT_HANDLE hObject, CK_SESSION_HANDLE hSession)
{
  CK_RV e_ret_status;
  CK_ATTRIBUTE_PTR p_template_embedded;
  CK_ULONG ul_count_embedded;
  CK_ATTRIBUTE_PTR p_attribute_embedded;


  /*Init default*/
  e_ret_status = CKR_GENERAL_ERROR;

  /* Get the pointer to the template of a specific object  */
  if (STSAFE_OBJ_GetTemplateFromObjectHandle(&p_template_embedded, &ul_count_embedded, hObject) == CKR_OK)
  {
    /* ========== Check CKA_VENDOR_SESSION_HANDLE attribute ========== */
    /* Check for the specific attribute  */
    if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_embedded, CKA_VENDOR_SESSION_HANDLE, p_template_embedded,
                                           ul_count_embedded) == CKR_OK)
    {
      /* Set attribute  */
      e_ret_status = STSAFE_OBJ_SetAttributeValue(p_attribute_embedded, (CK_BYTE_PTR)&hSession,
                                                  sizeof(CK_SESSION_HANDLE));
    }
  }

  return e_ret_status;
}


/**
  * @brief  Set attribute for Vendor Object Availability .
  * @param  hObject    the object handle
  * @param  hSession   the session handle
  * @param  bValue     value to set
  * @retval CK_RV, CKR_GENERAL_ERROR, CKR_OK.
  */
static CK_RV ObjectSetVendorObjectAvailability(CK_OBJECT_HANDLE hObject, CK_BBOOL bValue)
{
  CK_RV e_ret_status;
  CK_ATTRIBUTE_PTR p_template_embedded;
  CK_ULONG ul_count_embedded;
  CK_ATTRIBUTE_PTR p_attribute_embedded;


  /*Init default*/
  e_ret_status = CKR_GENERAL_ERROR;

  /* Get the pointer to the template of a specific object  */
  if (STSAFE_OBJ_GetTemplateFromObjectHandle(&p_template_embedded, &ul_count_embedded, hObject) == CKR_OK)
  {
    /* ========== Check CKA_VENDOR_OBJECT_AVAILABILITY attribute ========== */
    /* Check for the specific attribute  */
    if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_embedded, CKA_VENDOR_OBJECT_AVAILABILITY, p_template_embedded,
                                           ul_count_embedded) == CKR_OK)
    {
      /* Set attribute  */
      e_ret_status = STSAFE_OBJ_SetAttributeValue(p_attribute_embedded,(CK_BYTE*)&bValue, sizeof(CK_BBOOL));
    }
  }

  return e_ret_status;
}



/**
  * @brief  Checks if a mechanism type is allowed.
  * @param  MechanismIn    mechanism
  * @param  pMechanism     mech. array
  * @param  ulValueLen     length of the mechanism array
  * @retval CK_BBOOL CK_TRUE, CK_FALSE.
  */
static CK_BBOOL IsMechanismTypeAllowed(CK_MECHANISM_TYPE MechanismIn, CK_MECHANISM_PTR  pMechanism, CK_ULONG ulValueLen)
{
  CK_ULONG i;

  if ((pMechanism == NULL_PTR) || (ulValueLen == 0))
  {
    return CK_FALSE;
  }

  /* Look in the mechanism array for MechanismIn*/
  for (i = 0; i < ulValueLen; i++)
  {
    if (pMechanism->mechanism == MechanismIn)
    {
      return CK_TRUE;
    }

    pMechanism++;
  }
  return CK_FALSE;
}

/**
  * @brief  Get attribute value from a template.
  * @param  pValue     gets the attribute value.
  * @param  pulValueLen     gets the attribute value len.
  * @param  Type    attribute to extract from the template.
  * @param  pTemplate     template to look for the attribute
  * @param  ulCount    number of attributes in the template.
  * @retval CK_RV CKR_ATTRIBUTE_TYPE_INVALID, CKR_FUNCTION_FAILED, CKR_GENERAL_ERROR, CKR_OK.
  */
static CK_RV GetAttributeValueFromTemplate(CK_BYTE_PTR pValue,  CK_ULONG_PTR pulValueLen, CK_ATTRIBUTE_TYPE Type,
                                           CK_ATTRIBUTE_PTR pTemplate, CK_ULONG ulCount)
{
  CK_RV e_ret_status;
  CK_ATTRIBUTE_PTR p_attribute;
  CK_EXT_TOKEN_ZONE zone;
  CK_EXT_TOKEN_ZONE_AC access_condition;

  /* ========== Look for the specific attribute type  ========== */

  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute, Type, pTemplate, ulCount) != CKR_OK)
  {
    return CKR_ATTRIBUTE_TYPE_INVALID;
  }

  /* ================ Check if the value is available on STSAFE ==============*/
  /* Note: if VALUE is stored in External Token, CKA_VALUE has pValue == NULL_PTR and ulValueLen ==0UL */

