jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/BootLoader_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
  if ((Type == CKA_VALUE) && (p_attribute->pValue == NULL_PTR) && (p_attribute->ulValueLen == 0UL))
  {
    /* Check if this attribute is stored in any STSAFE Zone: i.e. if CKA_EXT_TOKEN_ZONE is present*/
    if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute, CKA_EXT_TOKEN_ZONE, pTemplate, ulCount) == CKR_OK)
    {
      zone = (*((CK_EXT_TOKEN_ZONE *)(p_attribute->pValue)));

      /* Check what is STSAFE access condition required to access this zone */
      if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute, CKA_EXT_TOKEN_ZONE_AC, pTemplate, ulCount) == CKR_OK)
      {
        access_condition = (*((CK_EXT_TOKEN_ZONE_AC *)(p_attribute->pValue)));

        /* Read a certificate from STSAFE zone */
        /* Note: in this implementaiton the assumption is that STSAFE zones contain only certificates, one
                certificate per zone. */
        if (StSafeReadCertificate(pValue, (uint32_t *)pulValueLen, zone, access_condition) != STSAFEA_OK)
        {
          e_ret_status = CKR_FUNCTION_FAILED;
        }
        else
        {
          e_ret_status = CKR_OK;
        }
      }
      else
      {
        e_ret_status = CKR_ATTRIBUTE_TYPE_INVALID;
      }
    }
    else
    {
      e_ret_status = CKR_ATTRIBUTE_TYPE_INVALID;
    }
  }
  else
  {
    /* Attribute value is stored locally : Retrieve the value from embedded object */
    e_ret_status = STSAFE_OBJ_GetAttributeValue(pValue, pulValueLen, p_attribute);
  }

  return e_ret_status;
}

/**
  * @brief  Check if the attribute is sensitive.
  * @param  Type    attribute to check.
  * @param  pTemplate  template to look for the attribute
  * @param  ulCount    number of attributes in the template.
  * @retval CK_BBOOL CK_TRUE, CK_FALSE.
  */
static CK_BBOOL IsAttributeSensitive(CK_ATTRIBUTE_TYPE Type, CK_ATTRIBUTE_PTR pTemplate, CK_ULONG ulCount)
{
  CK_BBOOL sensitive, cka_extractable, cka_sensitive;
  CK_OBJECT_CLASS obj_class;
  CK_ATTRIBUTE_PTR p_attribute_tmp;

  /* Extract CKA_CLASS attribute from the template */
  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_CLASS, pTemplate, ulCount) != CKR_OK)
  {
    /*If object class is not recognized, the object is considered sensitive*/
    sensitive = CK_TRUE;
  }
  else
  {
    obj_class = (*((CK_OBJECT_CLASS *)(p_attribute_tmp->pValue)));

    /* Check sensitive depending on the object class */
    switch (obj_class)
    {
      case CKO_PRIVATE_KEY:

        /*set default values*/
        cka_sensitive = CK_TRUE;
        cka_extractable = CK_FALSE;

        /* Check CKA_SENSITIVE attribute */
        if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_SENSITIVE, pTemplate, ulCount) == CKR_OK)
        {
          cka_sensitive = (*((CK_BBOOL *)(p_attribute_tmp->pValue)));
        }

        /* Check CKA_EXTRACTABLE attribute */
        if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_EXTRACTABLE, pTemplate, ulCount) == CKR_OK)
        {
          cka_extractable = (*((CK_BBOOL *)(p_attribute_tmp->pValue)));
        }

        /* Check the attributes with two configuration lists depending on the attributes of
         * CKA_SENSITIVE or CKA_EXTRACTABLE*/
        if ((cka_sensitive == CK_TRUE) || (cka_extractable == CK_FALSE))
        {
          sensitive = IsAttributeTypeInList(Type, a_SensAttList_CkoPrivateKey_NotExtr,
                                            SensAttList_CkoPrivateKey_NotExtrLen);
        }
        else
        {
          sensitive = IsAttributeTypeInList(Type, a_SensAttList_CkoPrivateKey_Extr,
                                            SensAttList_CkoPrivateKey_ExtrLen);
        }

        break;

      case CKO_SECRET_KEY:
        /*set default values*/
        cka_sensitive = CK_TRUE;
        cka_extractable = CK_FALSE;

        /* Check CKA_SENSITIVE attribute */
        if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_SENSITIVE, pTemplate, ulCount) == CKR_OK)
        {
          cka_sensitive = (*((CK_BBOOL *)(p_attribute_tmp->pValue)));
        }

        /* Check CKA_EXTRACTABLE attribute */
        if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_EXTRACTABLE, pTemplate, ulCount) == CKR_OK)
        {
          cka_extractable = (*((CK_BBOOL *)(p_attribute_tmp->pValue)));
        }

        /*Check the attributes with two configuration lists depending on the attributes of CKA_SENSITIVE or
        CKA_EXTRACTABLE*/
        if ((cka_sensitive == CK_TRUE) || (cka_extractable == CK_FALSE))
        {
          sensitive = IsAttributeTypeInList(Type, a_SensAttList_CkoSecretKey_NotExtr,
                                            SensAttList_CkoSecretKey_NotExtr);
        }
        else
        {
          sensitive = IsAttributeTypeInList(Type, a_SensAttList_CkoSecretKey_Extr,
                                            SensAttList_CkoSecretKey_ExtrLen);
        }
        break;

      case CKO_PUBLIC_KEY:
        /* CKO_PUBLIC_KEY objects are extractable by definition, they don't have CKA_EXTRACTABLE attribute*/
        sensitive = IsAttributeTypeInList(Type, a_SensitiveAttributesList_CkoPublicKey,
                                          SensitiveAttributesList_CkoPublicKeyLen);
        break;

      case CKO_CERTIFICATE:
        /* CKO_CERTIFICATE objects are extractable by definition, they don't have CKA_EXTRACTABLE attribute*/
        sensitive = IsAttributeTypeInList(Type, a_SensitiveAttributesList_CkoCertificate,
                                          SensitiveAttributesList_CkoCertificateLen);
        break;

      default:
        /*If object is not known - sensitive is true */
        sensitive = CK_TRUE;
        break;
    }
  }


  return sensitive;
}


/**
  * @brief  Read the content of a zone from STSAFE.
  * @param  ulZone     zone number.
  * @param  ulOffset     offset from where to start reading.
  * @param  pucData     gets the Data value.
  * @param  ulDataSize     data len.
  * @param  AccessCondition     type of access condition.
  * @retval CK_RV CKR_GENERAL_ERROR, CKR_OK.
  */
static CK_RV StSafeReadZone(uint8_t uZone, uint32_t ulOffset, uint8_t *pucData, uint32_t ulDataSize,
                            uint8_t AccessCondition)
{
  StSafeA_LVBuffer_t read_buffer;
  uint32_t index;
  uint32_t tmp_len;
  uint32_t tmp_offset;

  tmp_len = ulDataSize;
  tmp_offset = ulOffset;

