jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/BootLoader_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
  index = 0UL;

  /*Split the read in multiple chunks considering the limit of ST-SAFE DATA CONTENT size buffer */
  while (tmp_len >= STSAFEA_BUFFER_DATA_CONTENT_SIZE)
  {
    /* Read from STSAFE partition */
    if (StSafeA_Read(&hStSafe, 0U, 0U, STSAFEA_AC_ALWAYS, uZone, (uint16_t)tmp_offset,
                     (uint16_t)STSAFEA_BUFFER_DATA_CONTENT_SIZE, &read_buffer, AccessCondition) != STSAFEA_OK)
    {
      return CKR_GENERAL_ERROR;
    }

    /* Assign to output buffer if !=NULL*/
    if (pucData != NULL_PTR)
    {
      (void)memcpy(&pucData[index], read_buffer.Data, read_buffer.Length);
      index += STSAFEA_BUFFER_DATA_CONTENT_SIZE;
    }

    /* Update offset and len */
    tmp_offset += STSAFEA_BUFFER_DATA_CONTENT_SIZE;
    tmp_len -= STSAFEA_BUFFER_DATA_CONTENT_SIZE;
  }

  /*Update the last chunk*/
  if (tmp_len != 0UL)
  {
    /* Read from STSAFE partition */
    if (StSafeA_Read(&hStSafe, 0U, 0U, STSAFEA_AC_ALWAYS, uZone, (uint16_t)tmp_offset, (uint16_t)tmp_len,
                     &read_buffer, AccessCondition) != STSAFEA_OK)
    {
      return CKR_GENERAL_ERROR;
    }

    /* Assign to output buffer if !=NULL*/
    if (pucData != NULL_PTR)
    {
      (void)memcpy(&pucData[index], read_buffer.Data, tmp_len);
    }
  }

  return CKR_OK;
}

/**
  * @brief  Read Certificate from STSAFE.
  * @param  pValue     gets the Data value.
  * @param  pulValueLen     data len.
  * @param  Zone     gets the Data value.
  * @param  AccessCondition     type of access condition.
  * @retval CK_RV CKR_GENERAL_ERROR, CKR_OK.
  */
static CK_RV StSafeReadCertificate(uint8_t *pValue, uint32_t *pulValueLen, uint8_t Zone, uint8_t AccessCondition)
{
  CK_BYTE a_sequence_header[4U];
  CK_ULONG ul_cert_len = 0UL;

  /* Check input parameters */
  if (pulValueLen == NULL_PTR)
  {
    return CKR_GENERAL_ERROR;
  }

  /* Read Certificate header */
  if (StSafeReadZone(Zone, 0U, a_sequence_header, sizeof(a_sequence_header), AccessCondition) != STSAFEA_OK)
  {
    return CKR_GENERAL_ERROR;
  }

  /* Parse the header and extract certificate len*/
  if (GetLenDerASN1SequenceHeader(&ul_cert_len, a_sequence_header, sizeof(a_sequence_header)) != CKR_OK)
  {
    return CKR_GENERAL_ERROR;
  }

  /*Copy value out only if pointer is != NULL_PTR*/
  /*No need to read the actual certificate if pointer is null*/
  if (pValue != NULL_PTR)
  {
    if (StSafeReadZone(Zone, 0U, pValue, ul_cert_len, AccessCondition) != STSAFEA_OK)
    {
      return CKR_GENERAL_ERROR;
    }
  }

  /* Copy valueLen out */
  *pulValueLen = ul_cert_len;

  return CKR_OK;
}

/* Public function prototypes -----------------------------------------------*/

/*!
 * \brief Update data through zone partition
 *
 * \param zone                   : Zone number
 * \param in_Data                : Data to copy inside zone
 * \param offset                 : Offset in selected zone
 * \return OK if no error
 */
static CK_RV StSafeUpdateZone(uint8_t zone, StSafeA_LVBuffer_t in_Data, uint16_t offset)
{
  uint8_t StatusCode = STSAFEA_OK;
  uint16_t Remaining_Data_To_Copy = 0;

  if (in_Data.Length <= MAX_SIZE_BUFFER_I2_FOR_DATAS)
  {

    STS_CHK(StatusCode, StSafeA_Update(&hStSafe, 0U, 0U, 0U, STSAFEA_AC_ALWAYS, zone, offset, &in_Data, STSAFEA_MAC_HOST_CMAC));

    if (StatusCode != STSAFEA_OK)
      return CKR_GENERAL_ERROR;

  }
  else /* Size of datas to be send exceed max size of STSAFE-Axx buffer, We have to split data's in blocks  */
  {
    uint16_t size = in_Data.Length;

    /* First Write of datas*/

    in_Data.Length = MAX_SIZE_BUFFER_I2_FOR_DATAS;

    STS_CHK(StatusCode, StSafeA_Update(&hStSafe, 0U, 0U, 0U, STSAFEA_AC_ALWAYS, zone, offset, &in_Data, STSAFEA_MAC_HOST_CMAC));

    if (StatusCode != STSAFEA_OK)
      return CKR_GENERAL_ERROR;

    /* Management of 2nd block of datas with max datas of 1000 bytes*/
    /* Check if it's needed to split in 2 */

    Remaining_Data_To_Copy = size - MAX_SIZE_BUFFER_I2_FOR_DATAS;

    if (Remaining_Data_To_Copy <= MAX_SIZE_BUFFER_I2_FOR_DATAS)
    {
      STSAFEA_DYNAMIC_ALLOCATE_LV_BUFFER_VAR(StSafeA_LVBuffer_t, DataUpdate, Remaining_Data_To_Copy + 2);
      DataUpdate.Length = Remaining_Data_To_Copy;

      for (uint8_t i = 0; i < DataUpdate.Length; i++)
      {
        DataUpdate.Data[i] = in_Data.Data[i + MAX_SIZE_BUFFER_I2_FOR_DATAS];
      }

      /* 2nd Write of datas*/

      STS_CHK(StatusCode, StSafeA_Update(&hStSafe, 0U, 0U, 0U, STSAFEA_AC_ALWAYS, zone, MAX_SIZE_BUFFER_I2_FOR_DATAS + offset, &DataUpdate,
                                         STSAFEA_MAC_HOST_CMAC));

      if (StatusCode != STSAFEA_OK)
        return CKR_GENERAL_ERROR;

      STSAFEA_DYNAMIC_FREE_LV_BUFFER_VAR(DataUpdate);
    }
    else /*  it's needed to split in 3 blocks*/
    {

      STSAFEA_DYNAMIC_ALLOCATE_LV_BUFFER_VAR(StSafeA_LVBuffer_t, DataUpdate, MAX_SIZE_BUFFER_I2_FOR_DATAS + 2);

      DataUpdate.Length = MAX_SIZE_BUFFER_I2_FOR_DATAS;

      for (uint8_t i = 0; i < DataUpdate.Length; i++)
      {
        DataUpdate.Data[i] = in_Data.Data[i + MAX_SIZE_BUFFER_I2_FOR_DATAS];
      }

      /* 2nd Write of datas*/

      STS_CHK(StatusCode, StSafeA_Update(&hStSafe, 0U, 0U, 0U, STSAFEA_AC_ALWAYS, zone, MAX_SIZE_BUFFER_I2_FOR_DATAS + offset, &DataUpdate,
                                         STSAFEA_MAC_HOST_CMAC));

      STSAFEA_DYNAMIC_FREE_LV_BUFFER_VAR(DataUpdate);

      if (StatusCode != STSAFEA_OK)
        return CKR_GENERAL_ERROR;
      Remaining_Data_To_Copy = size - 2 * MAX_SIZE_BUFFER_I2_FOR_DATAS;

      STSAFEA_DYNAMIC_ALLOCATE_LV_BUFFER_VAR(StSafeA_LVBuffer_t, DataUpdate2, Remaining_Data_To_Copy + 2);
      DataUpdate2.Length = Remaining_Data_To_Copy;

      for (uint8_t i = 0; i < DataUpdate2.Length; i++)
      {
        DataUpdate2.Data[i] = in_Data.Data[i + 2 * MAX_SIZE_BUFFER_I2_FOR_DATAS];
      }

      /* third Write of datas*/

      STS_CHK(StatusCode, StSafeA_Update(&hStSafe, 0U, 0U, 0U, STSAFEA_AC_ALWAYS, zone, 2 * MAX_SIZE_BUFFER_I2_FOR_DATAS + offset, &DataUpdate2, STSAFEA_MAC_HOST_CMAC));

      if (StatusCode != STSAFEA_OK)
        return CKR_GENERAL_ERROR;

      STSAFEA_DYNAMIC_FREE_LV_BUFFER_VAR(DataUpdate2);
    }
  }

  return CKR_OK;
}

/**
  * @brief  Get Len value from ASN1 Sequence header.
  * @note: this implementation supports only Sequence with Len field <=0x82
  * @param  pulValueOutLen     sequence len.
  * @param  pValueIn     ASN1 Sequence header.
  * @param  ulValueInLen     data len.
  * @retval CK_RV CKR_GENERAL_ERROR, CKR_OK.
  */
static CK_RV GetLenDerASN1SequenceHeader(CK_ULONG_PTR pulValueOutLen, CK_BYTE_PTR pValueIn, CK_ULONG ulValueInLen)
{
  CK_RV e_ret_status;

