jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/BootLoader_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
  /*Copy value out only if pointer !=NULL_PTR*/
  if (pValueOut != NULL_PTR)
  {
    /* Set the header */
    pValueOut[i] = ASN_OCTET_STRING;
    i++;
    pValueOut[i] = (uint8_t) ulValueInLen;
    pValueOut[i] += 1U;
    i++;

    /*Set the value*/
    pValueOut[i] = DER_UNCOMPRESSED;
    i++;
    (void)memcpy(&pValueOut[i], pValueIn, ulValueInLen + 1UL) ;
  }

  return CKR_OK;
}



/**
  * @brief  Check if an attribute is included in a list.
  * @param  Type     attribute type to look in the list.
  * @param  pAttributeList     list of attributes to look into.
  * @param  ulCount list length.
  * @retval CK_FALSE, CK_TRUE.
  */
static CK_BBOOL IsAttributeTypeInList(CK_ATTRIBUTE_TYPE Type, CK_ATTRIBUTE_TYPE *pAttributeList, CK_ULONG ulCount)
{
  uint32_t i = 0;

  /* Check input parameters */
  if ((pAttributeList == NULL_PTR) || (ulCount == 0))
  {
    return CK_FALSE;
  }

  /*Look the whole list for the type*/
  for (i = 0; i < ulCount; i++)
  {
    if (pAttributeList[i] == Type)
    {
      return CK_TRUE;
    }
  }

  /* Attribute not found in the list*/
  return CK_FALSE;
}

/**
  * @brief  Get the object handle of a specific template.
  * @note   look for a byte-to-byte correspondance of the template.
  * @param  hSession     session handle.
  * @param  phObject     gets the object handles.
  * @param  ulMaxCount     max number of objects to return.
  * @param  pulObjectCount     gets the number of objects found.
  * @note   only = 1 is supported if ulCount!=0.
  * @param  pTemplate    the template
  * @param  ulCount    size of the template.
  * @note   if ulCount == 0, retrieve all objects.
  * @retval CK_RV CKR_GENERAL_ERROR, CKR_OK.
  */
CK_RV FindObjectsFromTemplate(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE_PTR phObject, CK_ULONG ulMaxCount,
                              CK_ULONG_PTR pulObjectCount,  CK_ATTRIBUTE_PTR pTemplate, CK_ULONG ulCount)
{
  CK_ATTRIBUTE_PTR p_template_embedded;
  CK_ATTRIBUTE_PTR p_attribute_embedded;
  CK_ULONG ul_count_embedded;
  CK_ULONG ul_attributes_found_count;
  CK_BYTE object_found;
  CK_OBJECT_HANDLE hObject, hObjectMin, hObjectMax;
  uint32_t i;

  /*Init*/
  object_found = 0;
  ul_attributes_found_count = 0;

  /*Get Objects handles for all objects allocated (token and session)*/
  if (STSAFE_OBJ_GetObjectRange(&hObjectMin, &hObjectMax) != CKR_OK)
  {
    return CKR_GENERAL_ERROR;
  }

  /*Init the loop*/
  hObject = hObjectMin;

  /*Loop on all local objects */
  while ((object_found < ulMaxCount) && (hObject < hObjectMax))
  {
    /* Get the pointer to the template of a specific object  */
    if (STSAFE_OBJ_GetTemplateFromObjectHandle(&p_template_embedded, &ul_count_embedded, hObject) != CKR_OK)
    {
      return CKR_GENERAL_ERROR;
    }

    /*Process only allocated objects */
    if ((p_template_embedded != NULL_PTR) && (ul_count_embedded != 0UL))
    {
      /* User is looking for objects with specific templates*/
      if (ulCount > 0UL)
      {
        /*Look for a specific sessions objects*/
        if (hSession != CKV_SESSION_HANDLE_ANY)
        {
          /* Check for the specific CKA_VENDOR_SESSION_HANDLE attribute  */
          if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_embedded, CKA_VENDOR_SESSION_HANDLE, p_template_embedded,
                                                 ul_count_embedded) == CKR_OK)
          {
            /*Check if CKA_VENDOR_SESSION_HANDLE == hSession*/
            if (*((CK_ULONG *)(p_attribute_embedded->pValue)) != hSession)
            {
              /*Skip this object - it is associated to another session*/
              hObject++;
              continue;
            }
          }

          if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_embedded, CKA_VENDOR_OBJECT_AVAILABILITY, p_template_embedded,
                                                  ul_count_embedded) == CKR_OK)
          {
            if (*((CK_BBOOL *)(p_attribute_embedded->pValue)) == FALSE)
            {
              /*Skip this object - it is destroyed */
              hObject++;
              continue;
            }
          }
        }

        /* Loop on all the attributes of the input template and
         * look for the corresponding attribute in the embedded template */
        for (i = 0; i < ulCount; i++)
        {
          /* Check for the specific attribute  */
          if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_embedded, pTemplate[i].type, p_template_embedded,
                                                 ul_count_embedded) == CKR_OK)
          {
            /* CKA ATTRIBUTE attribute found in the embedded object - now compare the two values */
            if (memcmp(p_attribute_embedded->pValue, pTemplate[i].pValue, p_attribute_embedded->ulValueLen) == 0)
            {
              /* Attribute found and the value is identical - increase the number of attributes found*/
              ul_attributes_found_count++;
            }
          }
        }

        /* Check if all the attributes were found */
        if (ul_attributes_found_count == ulCount)
        {
          /* Increment number of objects found*/
          phObject[object_found] = hObject;
          object_found++;
        }

        /* Reset the counter */
        ul_attributes_found_count = 0;

      }
      else
      {
        /* User is looking for all objects for this session(ulCount =0) */
        /* Check for the specific CKA_VENDOR_SESSION_HANDLE attribute  */
        if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_embedded, CKA_VENDOR_SESSION_HANDLE, p_template_embedded,
                                               ul_count_embedded) == CKR_OK)
        {
          /*Check if CKA_VENDOR_SESSION_HANDLE == hSession*/
          if (*((CK_ULONG *)(p_attribute_embedded->pValue)) == hSession)
          {
            /* If it is a session object, return the object only if assigned to this session*/
            phObject[object_found] = hObject;
            object_found++;
          }
        }
        else
        {
          /* Not a session object, return the object*/
          phObject[object_found] = hObject;
          object_found++;
        }
      }
    }

    hObject++;
  }

  /* Assign the output */
  *pulObjectCount = object_found;

  return CKR_OK;
}
